Repository: mishin/perldoc-ru
Catalog: pod2-ru/omegat/project_save.tmx
Source language: en_us
Languages: ru_ru

source: Besides, Perl can use a shell that may not be fit for interactive use, and setting COMSPEC to such a shell may interfere with the proper functioning of other programs (which usually look in COMSPEC to find a shell fit for interactive use).
ru_ru: Кроме того, можно использовать Perl оболочку, которая не может быть пригодным для интерактивного использования и настройки COMSPEC такой оболочке может повлиять надлежащего функционирования других программ (которые обычно смотрят в COMSPEC найти оболочке, пригодный для интерактивного использования).

source: Besides, a2p almost always guesses right.
ru_ru: Кроме того, A2P почти всегда угадывает правильно.

source: But the code that parses layer specification strings, which is also used to decode the PERLIO environment variable, treats the colon as a separator.
ru_ru: Но код, который анализирует спецификации уровня строк, который также используется для декодирования переменной PERLIO среды, лечится двоеточием в качестве разделителя.

source: By manually setting a seed, this protection may be partially or completely lost.
ru_ru: Путем ручной настройки семян, эта защита может быть частично или полностью потеряны.

source: C<BEGIN> and C<END> blocks may be used to capture control before or after the implicit loop, just as in I<awk>.
ru_ru: C<BEGIN> и C<END> Блоки могут быть использованы для захвата управления до или после неявного цикла, как и в I<awk>.

source: C<BEGIN> and C<END> blocks may be used to capture control before or after the implicit program loop, just as in I<awk>.
ru_ru: C<BEGIN> и C<END> блоки могут быть использованы для захвата управления до или после неявного цикла программы, как и в I<awk>.

source: C<INIT> and C<END> blocks, however, will be skipped.
ru_ru: C<INIT> и C<END> блоки, однаку, будут пропущены.

source: C<my> creates lexically scoped variables instead.
ru_ru: C<my> создает вместо этого лексическую область видимости переменных.

source: C<perldoc> also searches directories specified by the C<PERL5LIB> (or C<PERLLIB> if C<PERL5LIB> is not defined) and C<PATH> environment variables.
ru_ru: C<perldoc> также ищет в директориях определённых в переменных окружения C<PERL5LIB> (или C<PERLLIB>, если C<PERL5LIB> не определено) и C<PATH>.

source: C<perldoc> will use, in order of preference, the pager defined in C<PERLDOC_PAGER>, C<MANPAGER>, or C<PAGER> before trying to find a pager on its own.
ru_ru: C<perldoc>будет использовать пейджер, в порядке предпочтения, определённый в C<PERLDOC_PAGER>, C<MANPAGER>, или C<PAGER> перед тем как попытается найти собственный.

source: Categories of modules range from text manipulation to network protocols to database integration to graphics.
ru_ru: Категории модулей варьируются от манипуляций с текстом до сетевых протоколов, модулей для интеграции баз данных, для графики.

source: Check L<perlop> for more detail.)
ru_ru: Проверьте L<perlop> для больших подробностей.)

source: Command-interpreters on non-Unix systems have rather different ideas on quoting than Unix shells.
ru_ru: Командный интерпретаторы на не-Unix системах имеют отличные представления о том, как делать кавычки, чем в Unix shells.

source: Command-line options (switches).
ru_ru: Параметры командной строки (switches) переключатели.

source: Comments start with a hash symbol and run to the end of the line
ru_ru: Комментарии начинаются с хэш-символа '#' и продолжаются до конца строки

source: Compilation errors will tell you the line number of the error, with an indication of the next token or token type that was to be examined.
ru_ru: Ошибки компиляции скажут вам номер строки ошибки, с указанием следующей лексемы(оператора) или тип маркера(оператора), который должен был быть рассмотрен.

source: Configure is set up to prefer the "stdio" implementation if the system's library provides for fast access to the buffer; otherwise, it uses the "unix perlio" implementation.
ru_ru: Настройка настроена предпочтительность "STDIO" реализацию, если библиотеки системы обеспечивает быстрый доступ к буферу, в противном случае, он использует "UNIX PerlIO" реализации.

source: Consequently only built-in layers can appear in this list, as external layers (such as C<:encoding()>) need IO in order to load them!
ru_ru: Следовательно только встроенные слои могут появиться в этом списке, в качестве внешних слоев (например, C<:encoding()>) IO нужно для того, чтобы загрузить их!

source: Consider arguments as file names; no search in directories will be performed.
ru_ru: Рассматривать аргументы как имена файлов; поиск по каталогам производиться не будет.

source: Contained in the file specified by the first filename on the command line.
ru_ru: Сценарий находится в файле, указанном в первом имени файла в командной строке.

source: Create a batch file to run your program, and codify it in C<ALTERNATE_SHEBANG> (see the F<dosish.h> file in the source distribution for more information).
ru_ru: Создайте пакетный файл для запуска вашей программы, и кодифицируйте его в C<ALTERNATE_SHEBANG> (См. F<dosish.h> в файле в дистрибутива для получения дополнительной информации).

source: Current maintainer: Mark Allen C<< <mallen@cpan.org> >>
ru_ru: Текущий сопровождающий (maintainer): Mark Allen C<< <mallen@cpan.org> >>

source: Currently the only "unsafe" operations are attempting to unlink directories while running as superuser and running setuid programs with fatal taint checks turned into warnings.
ru_ru: В настоящее время единственной «небезопасной» операцией является пытка разорвать связь между каталогами, тогда, когда нет привилегий суперпользователя и работает SETUID программа со смертельными проверками меток (taint), которые превращаются в предупреждения.

source: Cute comments that say "# Here is a workaround because awk is dumb" are passed through unmodified.
ru_ru: Симпатичные комментарии, которые выглядят как "# Это обходной путь, потому что AWK является немым" и пропускает их без изменений.

source: Default is C<cmd.exe /x/d/c> on WindowsNT and C<command.com /c> on Windows95.
ru_ru: По умолчанию C<cmd.exe /x/d/c> на WindowsNT и C<command.com /c> на Windows 95.

source: Did we mention that you should definitely consider using the B<use warnings> pragma?
ru_ru: Мы упомянули, что вам обязательно надо рассмотреть возможность использования прагмы B<use warnings> ?

source: Different definitions of Perl are given in L<perl>, L<perlfaq1> and no doubt other places.
ru_ru: Различные определения Perl приведены в L<perl>, L<perlfaq1> не и несомненно в других местах.

source: Directories are separated (like in PATH) by a colon on Unixish platforms and by a semicolon on Windows (the proper path separator being given by the command C<perl -V:I<path_sep>>).
ru_ru: Каталоги разделяются (как в PATH) двоеточие на Unixi платформах и точки с запятой в Windows (правильный разделитель пути дается командой C<perl -V:I<path_sep>>).

source: Directories specified by B<-I> are prepended to the search path for modules (C<@INC>).
ru_ru: Каталоги, указанные B<-I> вставляются в пути поиска модулей (C<@INC>).

source: Disable executing F<$Config{sitelib}/sitecustomize.pl> at startup.
ru_ru: Отключает выполнение F<$Config{sitelib}/sitecustomize.pl> при запуске.

source: Disables all warnings regardless of C<use warnings> or C<$^W>.
ru_ru: Отключает все предупреждения независимо от C<use warnings> или C<$^W>.

source: Display docs using plain B<t>ext converter, instead of nroff.
ru_ru: Показывать документацию, используя текстовый конвертер (B<t>ext), а не nroff.

source: Display onB<l>y the file name of the module found.
ru_ru: Отобразить только (onB<l>y), если название модуля найдено.

source: Display the entire module: both code and unformatted pod documentation.
ru_ru: Показать содержимое модуля: код и неотформатированную POD-документацию.

source: Displays the version of perldoc you're running.
ru_ru: Отображает версию Perldoc с которой вы работаете.

source: Do not use it in production.
ru_ru: Не используйте его в продакшене.

source: Do not consider one style to be better than others - "There's More Than One Way To Do It" is one of Perl's mottos.
ru_ru: Не считайте один стиль лучше, чем другие - "Есть более чем один способ сделать это" ("There's More Than One Way To Do It" ) является одним из девизов Perl.

source: Do note that a switch like B<--help> creates the variable C<${-help}>, which is not compliant with C<use strict "refs">.
ru_ru: Заметьте, что, как переключатель B<--help> создает переменную C<${-help}>, который не соответствует C<use strict "refs">.

source: Do note that the examples have been written by many different authors over a period of several decades.
ru_ru: Нельзя не отметить, что примеры были написаны многими разными авторами в течение нескольких десятилетий.

source: Don't bother.
ru_ru: Не беспокойтесь.

source: Double quotes or single quotes may be used around literal strings:
ru_ru: Двойные или одинарные кавычки могут быть использованы вокруг символьных строк:

source: E 4 STDERR will be in UTF-8
ru_ru: E 4 STDERR будет в UTF-8

source: E.g., B<-d:DProf> executes the program using the C<Devel::DProf> profiler.
ru_ru: Например, B<-d:DProf> выполняет программу, используя C<Devel::DProf> профайлер (profiler).

source: Each version of Perl comes with the documentation that was current at the time of release.
ru_ru: Каждая версия Perl поставляется с документацией, актуальной на момент релиза.

source: Either put all the switches after the 32-character boundary (if applicable), or replace the use of B<-0>I<digits> by C<BEGIN{ $/ = "\0digits"; }>.
ru_ru: Либо поставить все переключатели после 32-символьной границы (если применимо), или замените использование B<-0>I<digits> на C<BEGIN{ $/ = "\0digits"; }>.

source: Enables all warnings regardless of C<no warnings> or C<$^W>.
ru_ru: Включает все предупреждения, независимо от C<no warnings> или C<$^W>.

source: Equivalent to the B<-C> command-line switch.
ru_ru: Эквивалент B<-C> командной строки.

source: Every time a hash is inserted into the key order will change in a random fashion.
ru_ru: Каждый раз, когда хэш вставляется в порядок ключей будет изменяться случайным образом.

source: Exactly like C:
ru_ru: Точно так же как C:

source: Example:
ru_ru: Пример:

source: Examples:
ru_ru: Примеры:

source: Except where otherwise noted, you should assume that C<use strict> and C<use warnings> statements appear earlier in the "program", and that any variables used have already been declared, even if those declarations have been omitted to make the example easier to read.
ru_ru: Если не оговорено иное, следует предполагать, что объявления C<use strict> и C<use warnings> уже есть в заголовке программы, и что любые переменные, используемые уже были объявлены, даже если эти декларации были опущены, чтобы сделать пример проще для чтения.

source: Exhaustive information on the topic of references can be found in L<perlreftut>, L<perllol>, L<perlref> and L<perldsc>.
ru_ru: Исчерпывающую информацию по теме ссылок можно найти в L<perlreftut>, L<perllol>, L<perlref> and L<perldsc>.

source: Finally, the B<-i> switch does not impede execution when no files are given on the command line.
ru_ru: Наконец, опция B<-i> не препятствует исполнению, когда файлы не заданы в командной строке.

source: First, it automatically chomps C<$/> (the input record separator) when used with B<-n> or B<-p>.
ru_ru: Во-первых, он автоматически обрезает (chomps) C<$/> (разделитель входных записей) при использовании B<-n> или B<-p>.

source: For example, if you have a version of I<find> which can print filenames terminated by the null character, you can say this:
ru_ru: Например, если у вас есть версии I<find> , которая может печатать имена файлов, завершающихся нулевым символом, то можно сказать следующее:

source: For URLs, HTTP and HTTPS are the only kind currently supported.
ru_ru: Для ссылок (URLs), HTTP и HTTPS являются единственным поддерживаемым видом.

source: For Unix platforms that will be the equivalent of "unix perlio" or "stdio".
ru_ru: Для Unix платформ, которые будут эквивалент "UNIX PerlIO" или "STDIO".

source: For a discussion of issues surrounding file permissions and B<-i>, see L<perlfaq5/Why does Perl let me delete read-only files?
ru_ru: Для обсуждения вопросов, связанных с правами доступа к файлам и B<-i>, см. L<perlfaq5/Why does Perl let me delete read-only files? (Почему Perl даёт мне удалить файлы только для чтения?)

source: For aesthetic reasons you may wish to change index variables from being 1-based (awk style) to 0-based (Perl style).
ru_ru: По эстетическим соображениям вы можете пожелать изменить индексных переменных от того, начинается с 1 (AWK стилю) до 0 на основе (Perl стиль).

source: For ease of access, the Perl manual has been split up into several sections.
ru_ru: Для удобства чтения руководство Perl был разделено на несколько частей.

source: For efficiency, you may wish to remove the keyword from any return statement that is the last statement executed in a subroutine.
ru_ru: Для эффективности, вы можете удалить ключевое слово из любого возвращенного выражения, что является последним оператором выполненным в подпрограмме.

source: For example, C<-w textsize:15> will call C<< $formatter->textsize(15) >> on the formatter object before it is used to format the object.
ru_ru: Например, C<-w textsize:15> вызовет C<< $formatter->textsize(15) >> до использования объекта форматирования.

source: For example, B<-COE> and B<-C6> will both turn on UTF-8-ness on both STDOUT and STDERR.
ru_ru: Например, B<-COE> и B<-C6> будут оба переключать UTF-8 режим на обоих STDOUT и STDERR.

source: For example, C<-oLaTeX> currently tries all of the following classes: Pod::Perldoc::ToLaTeX Pod::Perldoc::Tolatex Pod::Perldoc::ToLatex Pod::Perldoc::ToLATEX Pod::Simple::LaTeX Pod::Simple::latex Pod::Simple::Latex Pod::Simple::LATEX Pod::LaTeX Pod::latex Pod::Latex Pod::LATEX.
ru_ru: Например, C<-oLaTeX> пытается использовать следующие классы: Pod::Perldoc::ToLaTeX Pod::Perldoc::Tolatex Pod::Perldoc::ToLatex Pod::Perldoc::ToLATEX Pod::Simple::LaTeX Pod::Simple::latex Pod::Simple::Latex Pod::Simple::LATEX Pod::LaTeX Pod::latex Pod::Latex Pod::LATEX.

source: For example, C<PERL_MEM_LOG=1mst> logs all information to stdout.
ru_ru: Например, C<PERL_MEM_LOG=1mst> регистрирует все информацию на стандартный вывод.

source: For example, a module C<Foo::Bar> should use keys such as C<Foo::Bar/baz> and C<Foo::Bar/$%/_!>.
ru_ru: Например, модуль C<Foo::Bar> должны использовать ключи, такие как C<Foo::Bar/baz> и C<Foo::Bar/$%/_!>.

source: For example, any changes made to C<@INC> will show up in the output of `perl -V`.
ru_ru: Например, любые изменения, внесенные в C<@INC> будут отображаться в результатах `perl -V`

source: For example, given the statement
ru_ru: Например, возьмем выражение

source: For example, on Win32 platforms, the ".bat" and ".cmd" suffixes are appended if a lookup for the original name fails, and if the name does not already end in one of those suffixes.
ru_ru: Например, на платформах Win32 ". суффиксы ".bat" и ".cmd" добавляются, если поиск по оригинальному названию не удается, и если имя еще не закончится в одном из этих суффиксов.

source: For example, say you need to create a class implementing overloaded mathematical operators, and would like to provide your own pragma that functions much like C<use integer;> You'd like this code
ru_ru: Например, вам нужно создать класс, который реализует перегрузку математических операторов, и вы хотели бы использовать свою прагму с функционалом похожим на C<use integer;>. Пример кода:

source: For example:
ru_ru: Например:

source: For example: C<-oman>.
ru_ru: Например: C<-oman>.

source: For example: C<perldoc -MPod::Perldoc::ToChecker>.
ru_ru: Например: C<perldoc -MPod::Perldoc::ToChecker>.

source: For instance, in the example above, the final C<print $y> would cause a compile-time error and prevent you from running the program.
ru_ru: Например, в приведенном выше примере, конечный C<print $y> приведет к ошибке времени компиляции и препятствует запуску программы.

source: For instance, to trim lines to 80 columns:
ru_ru: Например, для обрезки линий до 80 символов/столбцов (columns):

source: For more detail on looping constructs (and some that weren't mentioned in this overview) see L<perlsyn>.
ru_ru: Более подробную информацию о конструкции цикла (и некоторые, которые не были упомянуты в этом обзоре) см. L<perlsyn>.

source: For more details see L<PerlIO>.
ru_ru: Для получения дополнительной информации см. L<PerlIO>.

source: For more information on these options, you can run C<perldoc perlrun>.
ru_ru: Для получения дополнительной информации на эти параметры, можно запустить C<perldoc perlrun>.

source: For more information on writing subroutines, see L<perlsub>.
ru_ru: Для получения дополнительной информации о написании подпрограмм см. L<perlsub>.

source: For more information, including instructions for other platforms such as Windows and Mac OS, read L<perlrun>.
ru_ru: Для получения дополнительной информации, в том числе инструкций для других платформ, таких как Windows и Mac OS, читайте L<perlrun>.

source: For security reasons, this option must be seen by Perl quite early; usually this means it must appear early on the command line or in the C<#!> line for systems which support that construct.
ru_ru: По соображениям безопасности, эта опция должна быть определена в Perl как можно раньше, обычно это означает, что он должен появиться на раннем этапе в командной строке или в строке C<#!> для систем, которые поддерживают такую конструкцию.

source: For simple names like 'foo', when the normal search fails to find a matching page, a search with the "perl" prefix is tried as well.
ru_ru: Для простых имен, как 'foo', когда нормальный поиск не удался, также пытайтесь найти соответствующую страницу поиска с префиксом "perl" .

source: For this to be valid, the formatter class must provide such a method, and the value you pass should be valid.
ru_ru: Для корректного выполнения, необходимо чтобы класс форматирования содержал такой метод, как переданный параметр, и значение было верным.

source: From the shell, saying
ru_ru: Из shell, говоря

source: From this we can determine that Perl is different things to different people, but that lots of people think it's at least worth writing about.
ru_ru: Из этого мы можем определить, что Perl предоставляет разные возможности для разных людей, но, что многие люди думают, что об этом по крайней мере стоит писать.

source: Hashes are randomized to protect against local and remote attacks against Perl code.
ru_ru: Хэши рандомизированных для защиты от удаленных и локальных атак против кода Perl.

source: Hashes have no particular internal order, though you can sort the keys and loop through them.
ru_ru: Хэш не имеют особого внутреннего порядка, хотя вы можете отсортировать ключи и делать через них циклы.

source: Having PERLDOCDEBUG set to a positive integer will make perldoc emit even more descriptive output than the C<-D> switch does; the higher the number, the more it emits.
ru_ru: При установке в PERLDOCDEBUG положительного целого числа perldoc выводит более подробно, чем это делает ключ C<-D>. Большее значение даёт больший вывод.

source: Hence the C<import> and C<unimport> routines are called at B<compile time> for the user's code.
ru_ru: Следовательно, C<import> и C<unimport> вызываются B<во время компиляции> пользовательского кода.

source: Here are some of them, in no particular order.
ru_ru: Вот некоторые из них, без особого порядка.

source: Here is an efficient way to delete all files that haven't been modified for at least a week:
ru_ru: Вот эффективный способ, чтобы удалить все файлы, которые не были изменены в течение по крайней мере недели:

source: Here's how you get at elements in an array:
ru_ru: Вот как вы можете вытащить элемент массива:

source: However, C<print()> can also take an optional first argument specifying which filehandle to print to:
ru_ru: Тем не менее, C<print()> может также взять дополнительный первый аргумент, указывающий на дескриптор файла для печати:

source: However, OO Perl is largely beyond the scope of this document.
ru_ru: Тем не менее, OO Perl в значительной степени выходит за рамки этого документа.

source: However, if the script dies, C<$@> will not be set.
ru_ru: Однако, если сценарий умирает (dies), C<$@> не будет установлен.

source: However, in short:
ru_ru: Тем не менее, коротко:

source: However, only double quotes "interpolate" variables and special characters such as newlines (C<\n>):
ru_ru: Однако, только двойные кавычки "интерполируют" переменные и специальные символы, такие как символы новой строки (C<\n>):

source: However, programs running setuid would do well to execute the following lines before doing anything else, just to keep people honest:
ru_ru: Тем не менее, программы, работающие SETUID не мешало бы выполнить следующие линии прежде чем делать что-либо еще, просто, чтобы держать людей честны:

source: However, the above usage will create global variables throughout your program, which is bad programming practice.
ru_ru: Однако, указанное использование будет создавать глобальные переменные на протяжении всей программы и это является плохой практикой программирования.

source: However, there is a clever way of making your one-line conditional blocks more English like:
ru_ru: Однако, есть хитрый способ сделать ваши однострочные условные блоки более похожими на английский язык, такие как:

source: However, this may cause problems if you have a firewall such as I<McAfee Guardian>, which requires that all applications use its LSP but which is not IFS-compatible, because clearly Perl will normally avoid using such an LSP.
ru_ru: Однако, это может вызвать проблемы, если у вас есть брандмауэр, таких как я <McAfee Guardian> , Который требует, чтобы все приложения используют ее LSP но который не является IFS-совместимы, потому что ясно Perl, как правило, не использовать такие LSP.

source: I 1 STDIN is assumed to be in UTF-8
ru_ru: I 1 STDIN считается в UTF-8

source: I guess that these will be options e and f (or F).
ru_ru: Я думаю, что это будут варианты e и f (или F).

source: I<A2p> takes an awk script specified on the command line (or from standard input) and produces a comparable I<perl> script on the standard output.
ru_ru: I<A2p> принимает AWK скрипт, указанный в командной строке (или со стандартного ввода) и производит сравнимых I<perl> скрипт стандартный вывод.

source: I<i.e.>, where C<use myint;> is in effect, addition operations are forced to integer, whereas by default they are not, with the default behaviour being restored via C<no myint;>
ru_ru: I<В примере>, в котором используется C<use myint;>, оператор сложения работает с целыми числами, значения по умолчанию не определены. Поведение по умолчанию будет восстановлено C<no myint;>

source: If PERL5OPT begins with B<-t>, tainting will be enabled, a writable dot removed from @INC, and subsequent options honored.
ru_ru: Если PERL5OPT начинается с B<-t>, заражение(tainting) будет включено, точка удаляется из @INC, и последующие опции учитываются (subsequent options honored).

source: If that can't be done, system administrators are strongly encouraged to put (symlinks to) perl and its accompanying utilities into a directory typically found along a user's PATH, or in some other obvious and convenient place.
ru_ru: Если это не может быть сделано, системным администраторам настоятельно рекомендуется поставить (символические ссылки) на Perl и сопутствующие утилиты в каталог, который обычно встречаются в пользовательском PATH (пути), или в некоторых других очевидных и удобных местах.

source: If B<-e> is given, Perl will not look for a filename in the argument list.
ru_ru: Если B<-e> задано, Perl не будет искать имя файла в списке аргументов.
